content/daily/2022-05-06.md
+++
title = "2022-05-06"
author = ["System Administrator"]
tags = ["draft", "draft"]
draft = false
+++

## The AI Lab {#the-ai-lab}


### Task3 {#task3}

use a `unsupervised` method to classify
details


#### clustering {#clustering}

-   k-means
-   dbsvan
-   density peaks
-   hierachical clustering
-   spectral clustering

cate

-   density
-   tree:hierachical
-   graph:spectral


#### get a python company back end {#get-a-python-company-back-end}

```emacs-lisp
(defun my/python-mode-hook ()
  (add-to-list 'company-backends 'company-jedi))

(add-hook 'python-mode-hook 'my/python-mode-hook)
```


## I tried supercollider {#i-tried-supercollider}

[this startup file](<~/Library/Application Support/SuperCollider/startup.scd>) change the output sample rate of supercollider's server or something. It booted! yes!


## OverTONE!!!!! {#overtone}

 the `at` function don't work at all. all time related don't work.
 a frequently occured error is
`java.util.concurrent.ExecutionException: java.lang.IllegalArgumentException: Cannot open <nil> as a Reader.`
Maybe the thread pool of the java library is not well mentained.